# Hora de Colocar a Mão na Massa com Pandas

1. Importe o pacote **pandas** e o pacote **numpy**.

In [1]:
import numpy as np
import pandas as pd

1. Considerando as listas **pais**, **mao_direita**, **carro_per_cap**, crie um dicionário denominado **carros**

In [7]:
pais = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
mao_direita =  [True, False, False, False, True, True, True]
carro_per_capta = [809, 731, 588, 18, 200, 70, 45]

In [9]:
carros = {
    'pais': pais,
    'mao_direita': mao_direita,
    'carro_per_capta': carro_per_capta
}

2. A partir do dicionário **carros** crie e imprima o dataframe **df_carrors**

In [92]:
print(carros)

df_carros = pd.DataFrame(carros)

print(df_carros)

print("----------------------------------------------------------------------------------------------------")
print(df_carros.head())
print(df_carros.head(3))
print("----------------------------------------------------------------------------------------------------")
print(df_carros.tail())
print(df_carros.tail(3))

{'pais': ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt'], 'mao_direita': [True, False, False, False, True, True, True], 'carro_per_capta': [809, 731, 588, 18, 200, 70, 45]}
            pais  mao_direita  carro_per_capta
0  United States         True              809
1      Australia        False              731
2          Japan        False              588
3          India        False               18
4         Russia         True              200
5        Morocco         True               70
6          Egypt         True               45
----------------------------------------------------------------------------------------------------
            pais  mao_direita  carro_per_capta
0  United States         True              809
1      Australia        False              731
2          Japan        False              588
3          India        False               18
4         Russia         True              200
            pais  mao_direita  carro_per_capta
0  United States         True              809
1      Australia        False              731
2          Japan        False              588
----------------------------------------------------------------------------------------------------
      pais  mao_direita  carro_per_capta
2    Japan        False              588
3    India        False               18
4   Russia         True              200
5  Morocco         True               70
6    Egypt         True               45
      pais  mao_direita  carro_per_capta
4   Russia         True              200
5  Morocco         True               70
6    Egypt         True               45

3. Indexe o dataframe **df_carros** utilizando a lista **labels**. Após isto imprima o dataframe **df_carros** novamente.

In [108]:
labels = ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']
df_carros.index = labels

print(df_carros)

              pais  mao_direita  carro_per_capta
US   United States         True              809
AUS      Australia        False              731
JAP          Japan        False              588
IN           India        False               18
RU          Russia         True              200
MOR        Morocco         True               70
EG           Egypt         True               45

4. Leia o arquivo **carros.csv** e armazene seu conteúdo no dataframe **df_carros**

In [109]:
df_carros = pd.read_csv('carros.csv')
print(df_carros)

  Unnamed: 0           pais  mao_direita  carro_per_capta
0         US  United States         True              809
1        AUS      Australia        False              731
2        JAP          Japan        False              588
3         IN          India        False               18
4         RU         Russia         True              200
5        MOR        Morocco         True               70
6         EG          Egypt         True               45

5. Observe que a coluna de indice está incorreta. Leia o arquivo novamente informando corretamente a coluna de índice.

In [110]:
df_carros = pd.read_csv('carros.csv', index_col=0)
print(df_carros)

              pais  mao_direita  carro_per_capta
US   United States         True              809
AUS      Australia        False              731
JAP          Japan        False              588
IN           India        False               18
RU          Russia         True              200
MOR        Morocco         True               70
EG           Egypt         True               45

6. Mostre a coluna **pais** do dataframe **df_carro** respectivamente como uma serie e como um dataframe.

In [111]:
df_carros['pais']

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: pais, dtype: object

In [112]:
df_carros[['pais']]

              pais
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

7. Mostre as colunas **pais** e **carro_per_capta** do dataframe **df_carros**

In [113]:
df_carros[['pais', 'carro_per_capta']]

              pais  carro_per_capta
US   United States              809
AUS      Australia              731
JAP          Japan              588
IN           India               18
RU          Russia              200
MOR        Morocco               70
EG           Egypt               45

8. Mostre as três primeiras linhas do dataframe **df_carros**

In [114]:
df_carros[:3]

              pais  mao_direita  carro_per_capta
US   United States         True              809
AUS      Australia        False              731
JAP          Japan        False              588

9. Mostre a quarta, quinta e sexta linhas do dataframe **df_carros**.

In [115]:
df_carros[3:6]

        pais  mao_direita  carro_per_capta
IN     India        False               18
RU    Russia         True              200
MOR  Morocco         True               70

10. Mostre as informações sobre o Japão (JAP) do dataframe **df_carros**.

In [118]:
df_carros.loc[["JAP"]]

      pais  mao_direita  carro_per_capta
JAP  Japan        False              588

11. Mostre as informações sobre a Austrália(AUS) e sobre o Egito(EG) que estão armazenadas no dataframe **df_carros**.

In [119]:
df_carros.loc[["AUS","EG"]]

          pais  mao_direita  carro_per_capta
AUS  Australia        False              731
EG       Egypt         True               45

12. Mostre o valor da coluna **carro_per_capta** do país Marrocos(MOR) que está armazenada no dataframe **df_carros**

In [120]:
df_carros.loc["MOR", "carro_per_capta"]

70

13. Mostre o valores das coluna **pais** e **carro_per_capta** do paises Marrocos(MOR) e Rússia(RU) que estão armazenadas no dataframe **df_carros**

In [121]:
df_carros.loc[["MOR", "RU"],["pais","carro_per_capta"]]

        pais  carro_per_capta
MOR  Morocco               70
RU    Russia              200

14. Mostre o valores das coluna **carro_per_capta**, como uma série, para todos os que estão armazenadas no dataframe **df_carros**. Utilize para isto **loc**.

In [122]:
df_carros.loc[:, "carro_per_capta"]

US     809
AUS    731
JAP    588
IN      18
RU     200
MOR     70
EG      45
Name: carro_per_capta, dtype: int64

15. Mostre o valores da coluna **carro_per_capta**, como um dataframe, para todos os que estão armazenadas no dataframe **df_carros**. Utilize para isto **loc**.

In [123]:
df_carros.loc[:, ["carro_per_capta"]]

     carro_per_capta
US               809
AUS              731
JAP              588
IN                18
RU               200
MOR               70
EG                45

16. Mostre o valores das colunas **mao_direita** e **carro_per_capta**, como um dataframe, para todos os que estão armazenadas no dataframe **df_carros**. Utilize para isto **loc**.

In [124]:
df_carros.loc[:, ["mao_direita", "carro_per_capta"]]

     mao_direita  carro_per_capta
US          True              809
AUS        False              731
JAP        False              588
IN         False               18
RU          True              200
MOR         True               70
EG          True               45

17. Extraia a coluna **mao_direita** do dataframe **df_carros** como uma série e armazene na variável **md**

In [80]:
md = df_carros["mao_direita"]
md

US      True
AUS    False
JAP    False
IN     False
RU      True
MOR     True
EG      True
Name: mao_direita, dtype: bool

18. Utilize a variável **md** para filtrar as linhas do dataframe **df_carros**.

In [81]:
df_carros[md]

              pais  mao_direita  carro_per_capta
US   United States         True              809
RU          Russia         True              200
MOR        Morocco         True               70
EG           Egypt         True               45

19. Mostre as linhas do dataframe **df_carros** cujas **carro_per_capta** seja maior do que **500**.

In [87]:
maior_que_500 = df_carros["carro_per_capta"] > 500
df_carros[maior_que_500]

              pais  mao_direita  carro_per_capta
US   United States         True              809
AUS      Australia        False              731
JAP          Japan        False              588

20. Mostre as linhas do dataframe **df_carros** cujas **carro_per_capta** seja maior do que **100** e menor do que **500**.

In [125]:
carro_per_capta = df_carros["carro_per_capta"]
entre_100_e_1000 = np.logical_and(carro_per_capta > 100, carro_per_capta < 1000)
df_carros[entre_100_e_1000]

              pais  mao_direita  carro_per_capta
US   United States         True              809
AUS      Australia        False              731
JAP          Japan        False              588
RU          Russia         True              200

21. Escreva um laço **for loop** para percorrer o dataframe **df_carros** imprimindo indice em uma linha e as demais informações entre outra linha. Utilize para isto o método do dataframe **iterrows()**.

In [127]:
for index, row in df_carros.iterrows():
    print(index)
    print(row)
    print("-----------------------------------------------------------------------------------")

US
pais               United States
mao_direita                 True
carro_per_capta              809
Name: US, dtype: object
-----------------------------------------------------------------------------------
AUS
pais               Australia
mao_direita            False
carro_per_capta          731
Name: AUS, dtype: object
-----------------------------------------------------------------------------------
JAP
pais               Japan
mao_direita        False
carro_per_capta      588
Name: JAP, dtype: object
-----------------------------------------------------------------------------------
IN
pais               India
mao_direita        False
carro_per_capta       18
Name: IN, dtype: object
-----------------------------------------------------------------------------------
RU
pais               Russia
mao_direita          True
carro_per_capta       200
Name: RU, dtype: object
-----------------------------------------------------------------------------------
MOR
pais               Morocco
mao_direita           True
carro_per_capta         70
Name: MOR, dtype: object
-----------------------------------------------------------------------------------
EG
pais               Egypt
mao_direita         True
carro_per_capta       45
Name: EG, dtype: object
-----------------------------------------------------------------------------------

22. Adapte o código anterior para imprimir para cada linha o seguinte formato "label:carro_per_capta".

In [128]:
for index, row in df_carros.iterrows():
    print("{}:{}".format(index, row['carro_per_capta']))
    print("-----------------------------------------------------------------------------------")

US:809
-----------------------------------------------------------------------------------
AUS:731
-----------------------------------------------------------------------------------
JAP:588
-----------------------------------------------------------------------------------
IN:18
-----------------------------------------------------------------------------------
RU:200
-----------------------------------------------------------------------------------
MOR:70
-----------------------------------------------------------------------------------
EG:45
-----------------------------------------------------------------------------------

23. Insira no dataframe **df_carros** a coluna PAIS que contenha o nome dos país em maiúsculo. Utilize o método apply. Após isto, imprima o dataframe.

In [129]:
df_carros["PAIS"] = df_carros["pais"].apply(str.upper)

In [130]:
df_carros

              pais  mao_direita  carro_per_capta           PAIS
US   United States         True              809  UNITED STATES
AUS      Australia        False              731      AUSTRALIA
JAP          Japan        False              588          JAPAN
IN           India        False               18          INDIA
RU          Russia         True              200         RUSSIA
MOR        Morocco         True               70        MOROCCO
EG           Egypt         True               45          EGYPT